<a href="https://colab.research.google.com/github/Asami1997/Python--Practice/blob/master/Week3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Merging Datasets

In [0]:
import pandas as pd
import numpy as np

In [0]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

Performing inner Join , the left_index and right_index indicates that we want to use the index column as the merging key

In [0]:
pd.merge(staff_df,student_df,how = 'inner', left_index = True, right_index= True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

Left Join

In [0]:
pd.merge(staff_df,student_df,how = 'left', left_index = True, right_index= True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

Right Join

In [0]:
pd.merge(staff_df,student_df,how = 'right',left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

Conflicting columns ( location) . it contaisn different values in both dataframes, if you join pandas will prserve both . it will append x to the left table's column and y to the right table's column

In [0]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])

In [0]:
pd.merge(staff_df,student_df,how = 'inner',left_on='Name',right_on='Name')

    Name            Role         Location_x       School            Location_y
0  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
1  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

Joining on multiple columns since the first name of some records match in both dataframes but the last name dose not

In [0]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [0]:
pd.merge(staff_df,student_df,how = 'inner', left_on=['First Name','Last Name'] ,right_on = ['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

calculating average using groupby

In [0]:
df = pd.read_csv('census.csv')

In [0]:
for state in df.groupby('STNAME'):
  avg = np.average(state['CENSUSPOP2010'])
  print("the average of the population is state {stname} is {average:.2f%}".format(stname = state,avg = average))

passing a dictionary that contains the columns we need to operate on and the function to apply on them. Look up the list of functions, you can use numpy functions as well to use

In [0]:
df.groupby('STNAME').agg({'CENSUSPOP2010' : np.average})

example using apply with lambda, dataset from coursera, the apply function will be applied on every chunk retured from groupby(every state)

In [0]:
df2.groupby('STNAME').apply(lambda df2,a,b : sum(a*b),'weight','quantity')

In [0]:
grades  = df['Grades'].astype('category',categories = ['F,D-,D,D+,C-','C','C+'], ordered = True)

Transoforming contious data into categorical using CUT to segement them into 3 bins

In [0]:
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])

# Your code her
pd.cut(s,3,labels['small','medium','large'])

PIVOT TABLES

comparing the brand of cars to years in terms of kw. the index can be more than one value. aggfunc can take more than one funciton and pandas will display hierarchial column names

In [0]:
cars = pd.read_csv('cars.csv')

In [0]:
cars.pivot_table(values = 'kw', index = 'year', columns = 'make',aggfunc = np.mean)